Merge pull request #10 from soorma-ai/dev
updated docs to reflect version 0.5.1
